#ifndef HP_FILE_H
#define HP_FILE_H
#include <record.h>



/* Η δομή HP_info κρατάει μεταδεδομένα που σχετίζονται με το αρχείο σωρού*/
typedef struct {

} HP_info;

/*Η συνάρτηση HP_CreateFile χρησιμοποιείται για τη δημιουργία και κατάλληλη αρχικοποίηση
ενός άδειου αρχείου σωρού με όνομα fileName. Σε περίπτωση που εκτελεστεί επιτυχώς,
επιστρέφεται 0, ενώ σε διαφορετική περίπτωση -1.*/
int HP_CreateFile(
    char *fileName, 	/*όνομα αρχείου*/
    Record_Attribute attr /*όνομα πεδίου-κλειδιού*/);

/* Η συνάρτηση HP_OpenFile ανοίγει το αρχείο με όνομα filename και διαβάζει από το πρώτο μπλοκ
την πληροφορία που αφορά το αρχείο σωρού. Κατόπιν, ενημερώνετε μια δομή όπου κρατάτε όσες
πληροφορίες κρίνετε αναγκαίες για το αρχείο αυτό προκειμένου να μπορείτε να επεξεργαστείτε στη
συνέχεια τις εγγραφές του. Μια ενδεικτική δομή με τις πληροφορίες που πρέπει να κρατάτε δίνεται
στη συνέχεια:
*/
HP_info* HP_OpenFile(char *fileName /*όνομα αρχείου*/);



/* Η συνάρτηση HP_CloseFile κλείνει το αρχείο που προσδιορίζεται μέσα στη δομή header_info.
Σε περίπτωση που εκτελεστεί επιτυχώς, επιστρέφεται 0, ενώ σε διαφορετική περίπτωση -1. Η συνάρτηση
είναι υπεύθυνη και για την αποδέσμευση της μνήμης που καταλαμβάνει η δομή που περάστηκε ως παράμετρος,
στην περίπτωση που το κλείσιμο πραγματοποιήθηκε επιτυχώς.*/
int HP_CloseFile(HP_info header_info );

/* Η συνάρτηση HP_InsertEntry χρησιμοποιείται για την εισαγωγή μίας εγγραφής στο αρχείο σωρού. Οι
πληροφορίες που αφορούν το αρχείο βρίσκονται στη δομή header_info, ενώ η εγγραφή προς εισαγωγή προσδιορίζεται
από τη δομή record. Σε περίπτωση που εκτελεστεί επιτυχώς, επιστρέφετε τον αριθμό του block στο οποίο έγινε η
εισαγωγή (blockId) , ενώ σε διαφορετική περίπτωση -1.*/
int HP_InsertEntry(HP_info header_info, /*επικεφαλίδα του αρχείου*/
    Record record /*δομή που προσδιορίζει την εγγραφή*/);

/*Η συνάρτηση αυτή χρησιμοποιείται για την εκτύπωση όλων των εγγραφών που υπάρχουν στο αρχείο κατακερματισμού
οι οποίες έχουν τιμή στο πεδίο-κλειδί ίση με value. Η πρώτη δομή δίνει πληροφορία για το αρχείο κατακερματισμού,
όπως αυτή είχε επιστραφεί από την HP_OpenFile. Για κάθε εγγραφή που υπάρχει στο αρχείο και έχει τιμή στο πεδίο-κλειδί
(όπως αυτό ορίζεται στην HP_info) ίση με value, εκτυπώνονται τα περιεχόμενά της (συμπεριλαμβανομένου και του πεδίου-κλειδιού).
Να επιστρέφεται επίσης το πλήθος των blocks που διαβάστηκαν μέχρι να βρεθούν όλες οι εγγραφές. Σε περίπτωση επιτυχίας επιστρέφει
το πλήθος των blocks που διαβάστηκαν, ενώ σε περίπτωση λάθους επιστρέφει -1.*/
int HP_GetAllEntries(HP_info header_info, /*επικεφαλίδα του αρχείου*/
	void *value /*τιμή του πεδίου-κλειδιού προς αναζήτηση*/);


#endif // HP_FILE_H
